app/Controllers/Home.php

SELECT *
FROM "MM_MASTER_LOKASI"
---
    public function viewupdate($id)
    {
        $lISTBPBModel = new LISTBPBModel();
        $mASTERLOKASIModel = new MASTERLOKASIModel();
        $kENDARAANModel = new KENDARAANModel();
        $divisiModel = new DivisiModel();
        $modelProduk = new ModelProduk();

        $data['LOKASI'] = $mASTERLOKASIModel->findAll();

UPDATE "MM_LIST_BPB" SET "MBLNR" = '12345678', "BUDAT" = '01-JAN-1970', "BPBNO" = '6868', "KUNNR" = 'Ataya', "CUSTOMER" = '', "LOKASI" = 'PT. INTENS', "ADR1" = 'GDG PT.INTI(PERSERO)', "ADR2" = 'JL. MOCH.TOHA  77', "ADR3" = 'BANDUNG', "CPN1" = 'BP.EKA PUTRA ADHIYASA', "TPN1" = '', "CPN2" = '', "TPN2" = '', "BUNDLE" = ('01'), "TGL_KIRIM" = '01-JAN-1970', "ZPONO" = ('02'), "PODAT" = '01-JAN-1970', "VENDOR" = ('INTI'), "KET" = '02', "POLNO" = '8888', "VIA" = 'Darat', "BWNM" = ('Riri'), "BWHP" = ('082256852'), "TRGDAT" = '09-JAN-1970', "NOTA" = ('02'), "KOLI1" = ('10'), "BERAT" = ('100'), "KEMBALI" = '01-JAN-1970', "BANTEX" = ('1234'), "NOTDAT" = '01-JAN-1970', "CATATAN" = 'tidak ada', "CATATAN2" = '', "KDKRJ" = '010400'
WHERE "MM_LIST_BPB"."BPBNO" IN ('6868')
---
            'KDKRJ' => $this->request->getPost('KDKRJ'),
        ];

        $lISTBPBModel->update($id, $data);

SELECT *
FROM "MM_REQUEST_RESERVASI"
---
    public function MonitoringReservation()
    {
        $monrevModel = new MonrevModel();
        $data['MM_REQUEST_RESERVASI'] = $monrevModel->findAll();